/* 
1.Опишіть своїми словами, що таке метод об'єкту
как я понимаю метод то функция, но определенная, т.е. фыделили некоторые распространеные функции и ввели их в библиотеку функций,
которые мы можем вызывать уже не прописывая их, а просто задав аргументы


2.Який тип даних може мати значення властивості об'єкта?
числа, сроки, тру/фолс, массивы, обьекты

3.Об'єкт це посилальний тип даних. Що означає це поняття?
то что в ячейке хранятся не сами данные а ссылка на них и если мы скопируем объект то в его свойствах будут не копии данных,
 а ссылки, т.е. если мы скопируем обьект и изменим данные в его свойствах - то изменятся данные и у того обьекта, так как оба разных
  (уже) обьекта имеют одну ссылку на данные 


Технічні вимоги:
Написати функцію createNewUser(), яка буде створювати та повертати об'єкт newUser.
При виклику функція повинна запитати ім'я та прізвище.
Використовуючи дані, введені юзером, створити об'єкт newUser з властивостями firstName та lastName.
Додати в об'єкт newUser метод getLogin(), який повертатиме першу літеру імені юзера, з'єднану з прізвищем, все в нижньому регістрі
 (наприклад, Ivan Kravchenko → ikravchenko).
Створити юзера за допомогою функції createNewUser(). Викликати у цього юзера функцію getLogin(). Вивести у консоль результат виконання
 функції.

  */
 function createNewUser() {
    let firstN = prompt("Введіть ваше ім'я");
    let lastN = prompt("Введіть ваше прізвище");
  
    let newUser = {
      firstName: firstN,
      lastName: lastN,
      getLogin: function() {
        return this.firstName.charAt(0).toLowerCase() + this.lastName.toLowerCase();
      }
    };
  
    return newUser;
  }
  
  let user = createNewUser();
  console.log(user.getLogin());

